{
  "narration": {
    "entry": {
      "generic": [
        "You step forward, boots loud in the stillness.",
        "The air grows colder as you cross the threshold.",
        "Shadows cling to the corners as you enter."
      ],
      "act1_gate": [
        "The Iron Gate looms before you like the jaw of a dead titan.",
        "The Citadel waits beyond the bars, patient as a tomb."
      ],
      "act1_courtyard": [
        "Bone and stone share the courtyard in uneasy silence.",
        "The wind stirs the weeds, and something stirs with it."
      ]
    },
    "threatReveal": {
      "generic": [
        "Something moves where nothing should move.",
        "Cold eyes fix on you from the dark.",
        "Steel and bone shift with murderous intent."
      ],
      "undead": [
        "Bones clatter together as the dead rise once more.",
        "Rot-slick fingers claw their way into the light."
      ],
      "cultist": [
        "A low chant dies on bloodless lips as they notice you.",
        "Robes whisper as the cultist turns, symbol of the Iron King glinting faintly."
      ]
    },
    "lootFind": {
      "generic": [
        "You sift through the wreckage and find something of value.",
        "Among the dust and ruin, a small treasure gleams.",
        "Your patience pays off; there is more here than bones and cobwebs."
      ],
      "hoard": [
        "For a moment, the curse feels far away as gold spills through your fingers.",
        "The vault may be shattered, but the wealth within still answers to no king."
      ]
    },
    "skillCheck": {
      "success": [
        "You take a moment to observe, and the truth slips neatly into place.",
        "Details others would miss stand out sharp and clear.",
        "Your training pays off; the Citadel yields one of its secrets."
      ],
      "failure": [
        "You search, but the Citadel is in no mood to share.",
        "The signs are there, but they refuse to resolve into meaning.",
        "You miss something important; the moment passes like smoke."
      ]
    },
    "postCombat": {
      "generic": [
        "Silence floods back in as the last foe falls.",
        "Breath ragged, you stand alone amid the wreckage.",
        "For now, at least, nothing else moves."
      ],
      "undead": [
        "The dead lie still again, but only for a while.",
        "Bone fragments settle, adding another layer to the Citadel’s grave-dust."
      ],
      "boss": [
        "The Fallen Knight crashes to the stone, its iron shell finally still.",
        "For a heartbeat the air lightens, as though the curse loosens its grip."
      ]
    }
  }
}
