{
  "narration": {
    "entry": {
      "side_storage_niche": [
        "The niche is barely big enough to stand upright; old grain dust tickles your throat.",
        "Crates lean at dangerous angles, ready to collapse at the slightest touch."
      ],
      "side_broken_shrine": [
        "The shrine feels wrong, like a prayer interrupted halfway through.",
        "Stone saints lie face-down in the dust, their blessings long since withdrawn."
      ],
      "side_barricaded_room": [
        "Whoever stacked this barricade knew fear well—and died with it.",
        "The room still smells faintly of sweat, oil, and panic."
      ],
      "side_forgotten_cell": [
        "Rust has eaten most of the bars, but the memory of imprisonment lingers.",
        "The air is thick with old breath and older misery."
      ],
      "side_collapsed_archive": [
        "Your footsteps stir clouds of paper dust like pale ghosts.",
        "Words crumble beneath your fingers as you brush aside the ruined pages."
      ]
    },
    "threatReveal": {
      "side_storage_niche": [
        "A skeletal hand claws its way over a crate, followed by the rest of its owner.",
        "Something skitters through the debris with hungry intent."
      ],
      "side_broken_shrine": [
        "The robed figure rises from its kneel as if pulled by unseen strings.",
        "The glow beneath the rubble flares as the cultist turns toward you."
      ],
      "side_barricaded_room": [
        "The barricade shudders as something pushes through from the far side.",
        "Splintered wood gives way, and steel-plated rot lurches into view."
      ],
      "side_forgotten_cell": [
        "Chains leap and dance as their owners remember the shape of violence.",
        "Bone scrapes iron as the prisoners stand to attention one last time."
      ]
    },
    "lootFind": {
      "side_storage_niche": [
        "Beneath a collapsed crate, something small and useful glints in the dust.",
        "Most of the supplies have rotted, but a few pieces have stubbornly endured."
      ],
      "side_broken_shrine": [
        "Among the broken offerings, one token still holds a trace of power.",
        "Not all prayers went unanswered; one blessing remains, waiting to be claimed."
      ],
      "side_barricaded_room": [
        "Whoever died defending this place left more than bones behind.",
        "A weapon lies half-hidden under a fallen shield, still serviceable."
      ],
      "side_forgotten_cell": [
        "The jailers were careless; their keys outlived their station.",
        "In a corner, forgotten by both guard and prisoner, something valuable waits."
      ],
      "side_collapsed_archive": [
        "Most pages crumble to dust, but a few fragments hold legible secrets.",
        "Between two ruined ledgers, a sealed scroll has survived intact."
      ]
    }
  }
}
